Repository: ferrine/blog
Catalog: source/locale/*/LC_MESSAGES/posts/2023/r2d2m2/post.po
Languages: ru

source: The R2D2M2 Prior, the Awwwesome Linear Regression
ru: R2D2M2 Prior, потрясающая линейная регрессия

source: There is an awesome paper that puts a simple idea of interpretable linear regression to an absolute. The `Intuitive Joint Priors for Bayesian Linear Multilevel Models: The R2D2M2 prior <https://arxiv.org/abs/2208.07132>`__. The idea resonates with me a lot, since I admire interpretable priors and the ability to describe the model, not an ability to explain.
ru: Есть замечательная статья, которая доводит до идеала простую идею интерпретируемой линейной регрессии. `Intuitive Joint Priors for Bayesian Linear Multilevel Models: The R2D2M2 prior <https://arxiv.org/abs/2208.07132>`__. Идея очень резонирует со мной, так как я восхищаюсь интерпретируемыми априорными распределениями и способностью описывать модель, а не способностью объяснять.

source: Explaining the model, you try to interpret parameters that are already present in the model, and you need to put some human-readable explanation of the meaning. It reminds me of the top-down approach, then you introduce parameters as you need them.
ru: Объясняя модель, вы пытаетесь интерпретировать параметры, которые уже присутствуют в модели, и вам нужно вложить какое-то понятное человеку объяснение смысла. Это напоминает мне нисходящий подход, когда вы вводите параметры по мере необходимости.

source: Describing the model is the opposite. You start with simple statements that you or your peers both understand. It is usually referred to as the bottom up approach, you start with assumptions you understand and complete the model as you go.
ru: Описание модели наоборот. Вы начинаете с простых утверждений, понятных вам или вашим коллегам. Обычно его называют подходом «снизу вверх». Вы начинаете с предположений, которые понимаете, и завершаете модель по мере продвижения.

source: Mastering the latter is the essence of Bayesian modeling. In this sense, the paper is of great interest to me.
ru: Освоение последнего является сутью байесовского моделирования. В этом смысле статья представляет для меня большой интерес.

source: Boston Housing Data
ru: Данные о жилье в Бостоне

source: As a benchmark dataset, I took the Boston housing dataset. It has the bare minimum to check the model parametrization. I took the part of the linear regression I really need and ignored varying intercept and varying slope. Here is the full model I'm referring to.
ru: В качестве контрольного набора данных я взял набор данных о жилье в Бостоне. У него есть минимум для проверки параметризации модели. Я взял ту часть линейной регрессии, которая мне действительно нужна, и проигнорировал вариативность параметров регрессии. Вот полная модель, о которой я говорю.

source: Let's finally get our hands dirty with code!
ru: Давайте, наконец, программировать!

source: It has to be remarked that I advocate normalizing your input data so it has :math:`\mathbb{E}[X]=0`, :math:`\mathbb{V}[X]=1`. This will save you a lot of time to figure out the right scale for slope parameters. Normalizing the output variable also makes a lot of sense. You may also notice that it is actually a part of the R2D2M2 linear regression parameterization. A rule of thumb is to take care of it one way or another.
ru: Следует отметить, что я настаиваю за нормализацию ваших входных данных, чтобы они имели :math:`\mathbb{E}[X]=0`, :math:`\mathbb{V}[Х]=1`. Это сэкономит вам много времени, чтобы определить правильный масштаб для параметров регрессии. Нормализация выходной переменной также имеет большой смысл. Вы также можете заметить, что на самом деле это часть параметризации линейной регрессии R2D2M2. Эмпирическое правило заключается в том, чтобы позаботиться об этом так или иначе.

source: We deal with positive outcome, prices. I would also expect the variable effect to have elasticity interpretation. To do so, I apply ``log`` transformation on positive valued regressors.
ru: Мы работаем с положительным результатом, ценами. Я также ожидаю, что переменный эффект будет иметь интерпретацию эластичности. Для этого я применяю логарифмическое преобразование к регрессорам с положительными значениями.

source: Non-centered R2D2M2
ru: Нецентрированный R2D2M2

source: Whenever I see a normal distribution with mean and scale, I tend to use non-centered parameterization. I was shocked to see how different it is from the centered case. But before we go to the working examples, let's see how to make an amazing model miserably fail.
ru: Всякий раз, когда я вижу нормальное распределение со средним значением и масштабом, я склонен использовать нецентрированную параметризацию. Я был потрясен, увидев, насколько он отличается от центрированного случая. Но прежде чем мы перейдем к рабочим примерам, давайте посмотрим, как заставить потрясающую модель с треском провалиться.

source: Yet it has no divergences, the parameter landscape is very complicated.
ru: И хотя у него нет расхождений, ландшафт параметров очень сложен.

source: Larger phi discourages large coefficients.
ru: Большие :math:`\phi` препятствуют большим коэффициентам.

source: There is also a banana shape relationship
ru: Существует также связь формы "банана"

source: Step size should be very different if you are in the center of the banana or on its boundary.
ru: Размер шага должен сильно различаться, если вы находитесь в центре банана или на его границе.

source: Total sampling time on my Supermicro is almost 1 hour 🤯
ru: Общее время выборки на моем Supermicro почти 1 час 🤯

source: Centered R2D2M2
ru: Центрированный R2D2M2

source: To my surprise, this model parametrization is 20 times faster than a non-centered variant. Once you download the notebook, you can play around with some parameters below to get the idea of R2D2M2 strong or weak places. Here is the bare minimum of what you should know about the model:
ru: К моему удивлению, параметризация этой модели в 20 раз быстрее, чем нецентрированный вариант. После того, как вы загрузите ноутбук, вы можете поиграть с некоторыми параметрами ниже, чтобы получить представление о сильных и слабых сторонах R2D2M2. Вот минимум того, что вы должны знать о модели:

source: You choose R2:
ru: Вы выбираете R2:

source: In econometrics classes, you've seen what is R2.
ru: На уроках эконометрики вы видели, что такое R2.

source: 1 - is a perfect data fit
ru: 1 - идеально описывает данные

source: 0 - total noise and predictors are irrelevant.
ru: 0 - общий шум и предикторы не имеют значения.

source: In a Bayesian setup, you do not pick one, you pick possible ones.
ru: В байесовском подходе вы выбираете не один, а возможные варианты.

source: A suggestion is to pick a :math:`95\%` range :math:`(R^2_{2.5\%}, R^2_{97.5\%})`.
ru: Предлагается выбрать диапазон :math:`95\%` :math:`(R^2_{2.5\%}, R^2_{97.5\%})`.

source: You choose variable importance:
ru: Вы выбираете важность переменных:

source: There are usually many variables in the regression, one you might assume is more important than another.
ru: Обычно в регрессии много переменных, и вы можете предположить, что одна важнее другой.

source: :math:`\alpha_i` is the parameter to look into to express the knowledge.
ru: :math:`\alpha_i` — это параметр, на который следует обратить внимание, чтобы выразить предположения.

source: :math:`\alpha_i=1` is total unawareness of the importance of the variable.
ru: :math:`\alpha_i=1` — это полное непонимание важности переменной.

source: :math:`\alpha_i<1` tells the model you tend to think the :math:`i`'th variable is likely to be not significant.
ru: :math:`\alpha_i<1` говорит модели, что вы склонны думать, что :math:`i`'я переменная, вероятно, не имеет значения.

source: :math:`\alpha_i>1` informs your model not to ignore the variable.
ru: :math:`\alpha_i>1` сообщает вашей модели, что переменную нельзя игнорировать.

source: Extremely large or small :math:`\alpha_i` may cause numerical problems or divergences
ru: Чрезвычайно большие или маленькие :math:`\alpha_i` могут вызвать численные проблемы или расхождения

source: 0.001 was too small
ru: 0,001 было слишком мало

source: 200 was too much
ru: 200 было слишком много

source: You can explore better reasonable bounds using this notebook
ru: Вы можете исследовать более разумные границы с помощью этого ноутбука

source: Combining residual and sigma
ru: Объединение остатка и сигмы

source: Sampling is much faster but there are divergences. Let's try to combine :math:`R^2` and :math:`\sigma`
ru: Выборка намного быстрее, но есть расхождения. Попробуем объединить :math:`R^2` и :math:`\sigma`

source: Yet, there is correlation in sigma and :math:`R^2`
ru: Тем не менее, есть корреляция между сигмой и :math:`R^2`

source: What did the job was:
ru: Что решило проблему:

source: Centered parametrization
ru: Центрированная параметризация

source: Attaching residual sigma to the model and :math:`R^2` parametrization
ru: Добавление остаточной сигмы к модели и параметризация :math:`R^2`

source: Sparse solution
ru: Разреженное решение

source: Now imagine we have some doubtful variables under consideration. We are unsure we should use them, but some of them may be helpful. To create a model under this setting, we need variable importance which are :math:`\alpha` in the model parameterization.
ru: Теперь представьте, что мы рассматриваем некоторые сомнительные переменные. Мы не уверены, что должны их использовать, но некоторые из них могут оказаться полезными. Чтобы создать модель с этой настройкой, нам нужны переменные важности, которые имеют значение :math:`\alpha` в параметризации модели.

source: The amount of sparsity is incredible. Yet, there are few divergences and I think it can be ignored there.
ru: Количество разреженности невероятно. Тем не менее, есть несколько дивергенций, и я думаю, что это может быть проигнорировано.

source: As authors claim, there are instabilities with low :math:`\alpha`, and general recommendation (personal experience) is to exclude non-informative variables and set variable importance :math:`\alpha` > 1
ru: Как утверждают авторы, при низкой :math:`\alpha` возникают нестабильности, и общая рекомендация (из личного опыта) состоит в том, чтобы исключить неинформативные переменные и установить важность переменной :math:`\alpha` > 1.

source: Conclusion
ru: Заключение

source: There are few practical advices to use R2D2M2 prior:
ru: Есть несколько практических советов по использованию R2D2M2 распределения:

source: Use the prior to weight variables that make sense. The sparsity inducing alpha leads to some instabilities (which you may ignore).
ru: Используйте дополнительную информацию, чтобы обозначить переменные, которые имеют смысл. Маленькие альфы, приводят к некоторым нестабильностям (которые вы можете иногда игнорировать).

source: Not always centered parametrization was great in my applications. I recommend trying both.
ru: Не всегда центрированная параметризация была хороша в моих задачах. Я рекомендую попробовать обе.

source: Coupling the error term sigma into the model leads to fewer instabilities and more interpretable sigma prior.
ru: Включение сигмы ошибки в модель приводит к меньшему количеству нестабильностей и более интерпретируемой сигме.

source: If you have new ideas after reading the notebook, want to discuss it in more details or want to work with me, you can always :doc:`reach me out </contacts>`.
ru: Если после прочтения поста у вас появились новые идеи, вы хотите обсудить их более подробно или хотите поработать со мной, вы всегда можете :doc:`связаться со мной </contacts>`.

source: Resources
ru: Ресурсы

source: Download the :download:`post.ipynb`
ru: Скачать :download:`post.ipynb`

source: Download the :download:`environment.yml`
ru: Скачать :download:`environment.yml`
