Repository: ferrine/blog
Catalog: source/locale/*/LC_MESSAGES/cases.po
Languages: ru

source: AB Testing
ru: А/Б-тестирование

source: AB Testing is a very common hypothesis testing technique in many companies. Bayesian AB testing is not a new but rarely used approach to a classical problem. Unlike traditional, Frequentist, approach, it enables more than qualitative decisions.
ru: A/Б-тестирование — очень распространенный метод проверки гипотез во многих компаниях. Байесовское A/B-тестирование — не новый, но редко используемый подход к классической задаче. В отличие от традиционного частотного подхода, он позволяет принимать более качественные решения.

source: Bayesian AB Testing is about qualitative answers to the same questions. So instead of "is there an effect", you can say "what is the effect". While this sounds similar, the latter enables to go beyond and do decision making with money in mind. You can plug Bayesian posterior into a financial model that translates to money language. Find more from the :doc:`ODS workshop </talks/2022/data-elka/event>`.
ru: Байесовское A/Б-тестирование — это качественные ответы на одни и те же вопросы. Так что вместо "есть ли эффект" можно сказать "каков эффект". Хотя это и звучит знакомо, последнее позволяет выйти за рамки и принимать решения с учетом затрат. Вы можете включить байесовскую апостериорную вероятность в финансовую модель, которая переводит результаты на язык денег. Узнайте больше из :doc:`ODS воркшопа </talks/2022/data-elka/event> `.

source: Bioinformatics
ru: Биоинформатика

source: Molecules are everywhere. Sometimes you need to figure out what a specific molecule is. There are numerous approaches to infer the molecule structure. One of them deals with a sequential procedure which is observed at every step with a lot of noise. The beauty is that this approach is cheap and scalable.
ru: Молекулы повсюду. Иногда нужно выяснить, что представляет собой конкретная молекула. Существует множество подходов к выводу структуры молекулы. Один из них касается последовательной процедуры, которая наблюдается на каждом шагу с большим количеством шума. Прелесть в том, что этот подход дешевый и масштабируемый.

source: The approach involves inference on the unobserved part of the experiment which generates the noisy observation. After understanding the latent process model Bayesian inference allowed to overcome influence of noise. In the project I developed parameter recovery study to understand which parts of the process are possible to control and which are not.
ru: Этот подход включает в себя вывод из ненаблюдаемой части эксперимента. Генерируется зашумленное наблюдение. После понимания модели скрытого процесса байесовский вывод позволил преодолеть влияние шума. В этом проекте я разработал исследование экспериментального дизайна, чтобы понять, какие части процесса можно контролировать, а какие нет.

source: Brain Activity
ru: Анализ поведенческой активности

source: Developing drugs is a very tedious process that involves rigor testing on animals and on humans. While treatment effect for most of the cases can be relatively easy quantified, brain activity is a challenge.
ru: Разработка лекарств — очень длительный процесс, который включает в себя тщательные испытания на животных и людях. В то время как эффект лечения в большинстве случаев может быть относительно легко определен количественно, активность мозга представляет собой сложную задачу.

source: Measuring qualitative activity of human brain is a very non trivial task. It is only possible to get indirect measurement of what is treated and patients participate in a game that involves certain brain activities. In PyMC Labs I helped to create the model and a packaged solution to estimate the latent property of brain activity. The Bayesian model allowed to compile indirect measurements to inform about drug efficiency.
ru: Измерение качественной активности человеческого мозга — весьма нетривиальная задача. Можно получить только косвенное измерение того, что лечится. А пациенты участвуют в игре, которая включает в себя определенные мозговые активности. В PyMC Labs я помог создать модель и комплексное решение для оценки латентного свойства мозговой активности. Байесовская модель позволила собрать косвенные измерения для информирования об эффективности лекарств.

source: Chemistry
ru: Химия

source: Chemistry is a very structured domain where there are either a lot of experimental data and knowledge available. Unfortunately, not all cases are such. There are real world scenarios where data is scarce and expensive.
ru: Химия — это очень структурированная область, в которой доступно много экспериментальных данных и знаний. К сожалению, не все случаи таковы. В реальном мире данных мало и они дорогие.

source: Predictions are not the holy grail when you want to optimize the production process. Characteristics of the process are the ones that are of the most interest. Bayesian approach allows to get insights from scarce data, and conclude on relations strength driving informed data driven decision making.
ru: Прогнозы — это не святой Грааль, когда вы хотите оптимизировать производственный процесс. Наибольший интерес представляют характеристики процесса. Байесовский подход позволяет получить глубокие наблюдения из недостаточных данных и сделать вывод о силе отношений, способствующих принятию обоснованных решений на основе данных.

source: Media Mix Models
ru: Маркетинговые модели

source: Media Mix Models are analytical tools used to optimize marketing strategies by measuring the effectiveness of various marketing channels. They help in determining the best combination of channels to maximize ROI, drive customer engagement, and allocate budget effectively. Bayesian Inference offers several benefits in marketing analytics, particularly when assessing channel effectiveness: Bayesian models can incorporate prior knowledge and adapt to new data, making them suitable for analyzing complex and dynamic marketing environments.
ru: Маркетинговые модели — это аналитические инструменты, используемые для оптимизации маркетинговых стратегий путем измерения эффективности различных маркетинговых каналов. Они помогают определить наилучшее сочетание каналов для максимизации рентабельности инвестиций, привлечения клиентов и эффективного распределения бюджета. Байесовский вывод предлагает несколько преимуществ в маркетинговой аналитике, особенно при оценке эффективности канала: байесовские модели могут включать в себя предыдущие знания и адаптироваться к новым данным, что делает их подходящими для анализа сложных и динамичных маркетинговых сред.

source: By accounting for uncertainty, Bayesian models provide more reliable and stable estimates, aiding in better-informed decision-making. Bayesian models can handle sparse or small datasets, enabling accurate analysis even with limited data. You can estimate individual channel impacts, allowing for tailored optimization of marketing efforts and budget allocation. As new data becomes available, Bayesian models can be updated easily, allowing marketers to stay current with evolving trends and make timely adjustments to their strategies.
ru: Учитывая неопределенность, байесовские модели обеспечивают более надежные и стабильные оценки, помогая принимать более обоснованные решения. Байесовские модели могут обрабатывать разреженные или небольшие наборы данных, обеспечивая точный анализ даже с ограниченными данными. Вы можете оценить влияние отдельных каналов, что позволит индивидуально оптимизировать маркетинговые усилия и распределение бюджета. По мере поступления новых данных байесовские модели можно легко обновлять, что позволяет маркетологам быть в курсе меняющихся тенденций и своевременно вносить коррективы в свои стратегии.
