Repository: ferrine/blog
Catalog: source/locale/*/LC_MESSAGES/index.po
Languages: ru

source: Solving White-Box Problems
ru: Решения для Интерпретируемых Задач

source: My core principles are:
ru: Мои основные принципы:

source: **Be Focused.** I work exclusively with interpretable models and create transparent solutions.
ru: **Держать фокус.** Я работаю исключительно с интерпретируемыми моделями и создаю прозрачные решения.

source: **Be Erudite.** I have wide machine learning expertise to know when you need Bayesian approach.
ru: **Быть эрудированным.** У меня большой опыт в области машинного обучения, чтобы знать, когда вам нужен байесовский подход.

source: **Be Oriented.** I focus on core needs first, that is where a good project starts.
ru: **Приверженность результату.** Сначала я сосредотачиваюсь на основных потребностях. С этого и начинается хороший проект.

source: **Share knowledge.** I love to educate about the statistical model, so you are familiar with it.
ru: **Делиться знаниями.** Я с удовольствием рассказываю о статистической модели, чтобы вы знали как ей пользоваться.

source: **Be Helpful.** If you do not need Bayesian inference I can still help you find a research direction.
ru: **Быть полезным.** Если вам не нужен байесовский вывод, я все равно могу помочь вам найти направление исследований.

source: Contact Me
ru: Связаться со мной

source: When Bayesian
ru: Когда байесовский подход

source: Is your problem white box?
ru: Ваша проблема — это белый ящик?

source: If your problem is not white box it makes little sense to use Bayesian methods. The approach relies on clear understanding and reasoning about the problem.
ru: Если ваша проблема — не белый ящик, нет смысла использовать байесовские методы. Подход основан на четком понимании и рассуждениях о проблеме.

source: How much do you know about the problem?
ru: Как много вы знаете о проблеме?

source: The more you understand about the model and process it describes the better is the solution. No traditional approach takes this to the absolute and translates expert opinions to rigor definition.
ru: Чем больше вы понимаете модель и процесс, который она описывает, тем лучше решение. Никакой традиционный подход не учитывает это и не переводит мнения экспертов в интерпретируемые ограничения.

source: Do you understand causal relations of your problem?
ru: Вы понимаете причинно-следственные связи вашей задачи?

source: Understanding relations is a half-way to build a Bayesian model. Ignoring these relations leads to biased estimates and decisions.
ru: Понимание взаимосвязей — это половина пути к построению байесовской модели. Игнорирование этих связей приводит к необъективным оценкам и неэффективным решениям.

source: Do you need to interpret the solution?
ru: Вам нужно интерпретировать решение?

source: Clear interpretation is the core principle in Bayesian modeling. Every unknown parameter in the model is estimated using expert and data guidance. Using Bayesian approach you make maximum use of human in the loop data driven business processes.
ru: Четкая интерпретация является основным принципом байесовского моделирования. Каждый неизвестный параметр в модели оценивается с использованием рекомендаций экспертов и данных. Используя байесовский подход, вы максимально используете человека в бизнес-процессах опираясь на данные.

source: Do you need just predictions or something more?
ru: Вам нужны только прогнозы или что-то большее?

source: If predictions is all you care about, I suggest looking into :xref:`misc:conformal-prediction`. It helps to take in account uncertainty for the prediction tasks. If this does not help, and you need uncertainty in model interpretation for your decision process, Bayesian approach is for you.
ru: Если вас интересуют только прогнозы, я предлагаю изучить :xref:`misc:conformal-prediction`. Это помогает учитывать неопределенность для задач прогнозирования. Если это не помогает, и вам нужна неопределенность в интерпретации модели для вашего процесса принятия решений, байесовский подход для вас.

source: How I work
ru: Как я работаю

source: Marketing Mix Models
ru: Маркетинговые модели

source: Find the best allocation for your marketing budget
ru: Оптимизация вашего маркетингового бюджета

source: Brain Activity
ru: Анализ поведенческой активности

source: Explain brain activity using indirect measurements
ru: Объяснение активности мозга с использованием косвенных измерений

source: Bioinformatics
ru: Биоинформатика

source: Use structural assumptions to their fullest potential
ru: Использование структурных допущений в полной мере

source: Chemistry
ru: Химия

source: Iterate over complex chemical interactions to improve the whole manufacturing process
ru: Моделирование сложных химических взаимодействий, чтобы улучшить весь производственный процесс

source: A/B Testing
ru: A/Б-тестирование

source: Bring your critical thinking to improve the hypothesis testing pipeline
ru: Использование своего критическое мышления, чтобы улучшить проверку гипотез

source: Before any project starts:
ru: Перед началом любого проекта:

source: We discuss what are the real needs for you
ru: Мы обсуждаем, что вам действительно нужно

source: We figure out if project worth the time investment or there is a simple workaround
ru: Мы выясняем, стоит ли проект вложений времени или есть простой обходной путь

source: We investigate how to maximize the outcome of the collaboration, split the needs to options
ru: Мы изучаем, как максимизировать результат сотрудничества, переводим потребности на варианты решения

source: Worst Case
ru: Худший случай

source: Not every project is about beautiful models. If we do not fit each other, be sure I do my best to advice you the next steps to the best of my knowledge.
ru: Не каждый проект посвящен красивым моделям. Если мы не подходим друг другу, будьте уверены, я сделаю все возможное, чтобы посоветовать вам следующие шаги насколько это возможно.

source: Book a Call
ru: Заказать звонок

source: Teaching
ru: Преподавание

source: Here are my materials that may interest you:
ru: Вот мои материалы, которые могут вас заинтересовать:

source: I created modern Practical Bayes course for :xref:`MSU <talks:2022:msu-practical-bayes>`. It focuses on practical interpretable analytics and model analysis.
ru: Я создал современный практический курс Байеса для :xref:`МГУ <talks:2022:msu-practical-bayes>`. Основное внимание уделяется практической интерпретируемой аналитике и анализу моделей.

source: The course is recorded on YouTube in :xref:`State of Bayes <talks:2023:state-of-bayes>` playlist.
ru: Курс записан на YouTube в плейлист :xref:`State of Bayes <talks:2023:state-of-bayes>`.

source: For more learning materials follow the link below:
ru: Для получения дополнительных учебных материалов перейдите по ссылке ниже:

source: Learn Bayes
ru: Изучаем Байеса

source: Talks
ru: Выступления

source: I regularly participate in conferences, give talks and share knowledge about Bayesian statistics
ru: Я регулярно участвую в конференциях, выступаю с докладами и делюсь знаниями о байесовской статистике.

source: I link all the available materials:
ru: Прикрепляю все доступные материалы:

source: Video
ru: Видео

source: Presentation
ru: Презентация

source: Code
ru: Код

source: See all Talks
ru: Просмотреть все выступления

source: Browse Blog-posts
ru: Просмотр всех постов
