Repository: ferrine/blog
Catalog: source/locale/*/LC_MESSAGES/talks.po
Languages: ru

source: Bayesian AB Testing
ru: Байесовское А/Б-тестирование

source: I talk about the Bayesian approach to AB testing. The approach consists of 3 steps: making a hypothesis about the experiment, understanding time and data constraints, and interpreting the results after collecting the data. The advantage is that the Bayesian AB(C) test does not require p-values, corrections or bootstrap procedures, is conservative (does not exaggerate the result on small data) and is easily interpreted for business.
ru: Я говорю о байесовском подходе к А/Б-тестированию. Подход состоит из 3 шагов: выдвижение гипотезы об эксперименте, понимание ограничений по времени и данным и интерпретация результатов после сбора данных. Преимущество заключается в том, что байесовский тест AB(C) не требует p-значений, поправок или процедур бутстрапа, является консервативным (не преувеличивает результат на небольших данных) и легко интерпретируется для бизнеса.

source: Video
ru: Видео

source: Materials
ru: Материалы

source: :download:`Presentation <https://disk.yandex.ru/i/W6YxDdeX78pe1w>`
ru: :download:`Презентация <https://disk.yandex.ru/i/W6YxDdeX78pe1w> `

source: I talk about how Bayesian AB testing can drive conclusions from data. There is always the whole pipeline of decision making process: panning, execution and delivery. Each of the stages benefits from domain knowledge about the experimental setting. In the talk I explain how this can be framed from a Bayesian perspective.
ru: Я рассказываю о том, как байесовское А/Б-тестирование может помочь в выводах на основе данных. Всегда есть целый процесс принятия решений: планирование, исполнение и интерпретация. Каждый из этапов получает выгоду от знаний предметной области об условиях проведения эксперимента. В докладе я объясняю, как это можно представить с байесовской точки зрения.

source: Not ready
ru: Не готово

source: :download:`Presentation <https://disk.yandex.ru/i/5XPhxVH9Jas94Q>`
ru: :download:`Презентация <https://disk.yandex.ru/i/5XPhxVH9Jas94Q> `

source: Bayes in the Wild
ru: Байес в дикой природе

source: I talk about the Bayesian approach to wide range of problems. Show how it is related to traditional methods in ML and what tasks benefit from an alternative view.
ru: Я говорю о байесовском подходе к широкому кругу проблем. Показываю, как это связано с традиционными методами машинного обучения и каким задачам полезен альтернативный взгляд на решение.

source: :download:`Presentation <https://disk.yandex.ru/i/eiExGvv7wEtgbw>`
ru: :download:`Презентация <https://disk.yandex.ru/i/eiExGvv7wEtgbw> `
