Repository: ferrine/blog
Catalog: source/locale/*/LC_MESSAGES/teaching.po
Languages: ru

source: Teaching
ru: Преподавание

source: Books
ru: Книги

source: Fist of all a lot of materials already exist on the internet, and they are just amazing.
ru: Во-первых, в интернете уже есть много материалов, и они просто потрясающие.

source: Learn PyMC with Books
ru: Изучайте PyMC по учебникам

source: A collection of books is curated by PyMC Developers
ru: Коллекция книг курируется разработчиками PyMC.

source: Workshops
ru: Мастер-классы

source: I give lectures in university, webinar format and give corporate workshops. Feel free to reach me out if you want something customized.
ru: Читаю лекции в университете в формате вебинаров и корпоративные мастер-классы. Не стесняйтесь связаться со мной, если вы хотите что-то индивидуальное.

source: MSU Practical Bayes
ru: Прикладные Байесовские методы в МГУ

source: Modern practical course on Bayesian statistics
ru: Современный практический курс по байесовской статистике

source: :xref:`Announcement <talks:2022:msu-practical-bayes>`
ru: :xref:`Объявление <talks:2022:msu-practical-bayes> `

source: Webinar series on state of the art applied Bayesian statistics
ru: Серия вебинаров по передовой прикладной байесовской статистике

source: :doc:`Online Materials <teaching/state-of-bayes>`
ru: :doc:`Онлайн-материалы <teaching/state-of-bayes> `

source: Request a Workshop
ru: Запросить мастер-класс

source: State of Bayes is a series of webinars about advances in practical methods and modeling intuition. The major focus of the webinar series will be on understanding concepts of advanced statistical models and introducing prior knowledge into the loop. This free course will be interesting for Bayesian practitioners who want to deepen their understanding about Bayesian modeling.
ru: State of Bayes — это серия вебинаров о достижениях в практических методах и моделировании интуиции. Основное внимание в серии вебинаров будет уделено пониманию концепций передовых статистических моделей и внедрению в цикл предварительных знаний. Этот бесплатный курс будет интересен практикующим байесовскую статистику на работе, которые хотят углубить свое понимание байесовского моделирования.

source: Materials
ru: Материалы

source: :fa:`bars` :xref:`Full YouTube Playlist <talks:2023:state-of-bayes>`
ru: :fa:`bars` :xref:`Полный плейлист YouTube <talks:2023:state-of-bayes> `

source: :fab:`youtube` `Introduction <https://www.youtube.com/watch?v=X4y2UfU-2cs>`_
ru: :fab:`youtube` `Введение <https://www.youtube.com/watch?v=X4y2UfU-2cs> `_

source: :download:`Presentation <https://disk.yandex.ru/i/S3sqn1CyIVwW9A>`
ru: :download:`Презентация <https://disk.yandex.ru/i/S3sqn1CyIVwW9A> `

source: :fab:`youtube` `Bayesian Thinking <https://www.youtube.com/watch?v=L9XMT08_KgY>`_
ru: :fab:`youtube` Байесовское мышление <https://www.youtube.com/watch?v=L9XMT08_KgY> `_

source: :download:`Presentation <https://disk.yandex.ru/i/-ID8GxjQcQCSsQ>`
ru: :download:`Презентация <https://disk.yandex.ru/i/-ID8GxjQcQCSsQ> `

source: :fab:`youtube` `Hierarchical Modeling <https://www.youtube.com/watch?v=pnJgDSdgqVg>`_
ru: :fab:`youtube` `Иерархическое моделирование <https://www.youtube.com/watch?v=pnJgDSdgqVg> `_

source: :download:`Presentation <https://disk.yandex.ru/i/T-ugd8oS-B3joA>`
ru: :download:`Презентация <https://disk.yandex.ru/i/T-ugd8oS-B3joA> `

source: :fab:`youtube` `Interpretable Linear Regression <https://www.youtube.com/watch?v=fpS0NjqNHn8>`_
ru: :fab:`youtube` `Интерпретируемая линейная регрессия <https://www.youtube.com/watch?v=fpS0NjqNHn8> `_

source: :download:`Presentation <https://disk.yandex.ru/i/j-Yoe29iJAW0ZA>`
ru: :download:`Презентация <https://disk.yandex.ru/i/j-Yoe29iJAW0ZA> `

source: :fab:`youtube` `AB Testing <https://www.youtube.com/watch?v=QllfKQH-yQ4>`_
ru: :fab:`youtube` `А/Б-тестирование <https://www.youtube.com/watch?v=QllfKQH-yQ4> `_

source: :download:`Presentation <https://disk.yandex.ru/i/3hXlNyvyCXgprw>`
ru: :download:`Презентация <https://disk.yandex.ru/i/3hXlNyvyCXgprw> `

source: :fab:`youtube` `Gaussian Processes <https://www.youtube.com/watch?v=KJEoKsGJKEg>`_
ru: :fab:`youtube` `Гауссовские процессы <https://www.youtube.com/watch?v=KJEoKsGJKEg> `_

source: :download:`Presentation <https://disk.yandex.ru/i/v_hhau2ZytU0YQ>`
ru: :download:`Презентация <https://disk.yandex.ru/i/v_hhau2ZytU0YQ> `

source: :download:`Code <https://drive.google.com/file/d/1pCkOW-Q5r69GIDXgaiKfqzscQ8ymQmXb/view>`
ru: :download:`Код <https://drive.google.com/file/d/1pCkOW-Q5r69GIDXgaiKfqzscQ8ymQmXb/view> `

source: Gaussian Processes for Time Series
ru: Гауссовские процессы для временных рядов
