Repository: ferrine/blog
Catalog: source/locale/*/LC_MESSAGES/test.po
Languages: ru

source: Test CSS Layout
ru: Протестируйте макет CSS

source: This page demonstrates the basic directives for testing CSS layout in Sphinx reStructuredText.
ru: На этой странице демонстрируются основные директивы для тестирования макета CSS в Sphinx reStructuredText.

source: Headings
ru: Заголовки

source: # with overline, for parts
ru: # С разделителем

source: with overline, for chapters
ru: с подчеркиванием, для глав

source: =, for sections
ru: =, для секций

source: -, for subsections
ru: -, для подразделов

source: ^, for subsubsections
ru: ^, для подразделов

source: “, for paragraphs
ru: ", для абзацев

source: Example
ru: Пример

source: Paragraphs
ru: Пункты

source: This is an example of a paragraph. Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.
ru: Это пример абзаца. Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut Labore et dolore magna aliqua.

source: Lists
ru: Списки

source: This is an example of an unordered list item.
ru: Это пример элемента неупорядоченного списка.

source: Another unordered list item.
ru: Еще один элемент ненумерованного списка.

source: This is an example of an ordered list item.
ru: Это пример элемента упорядоченного списка.

source: Another ordered list item.
ru: Еще один элемент упорядоченного списка.

source: Code Blocks
ru: Блоки кода

source: Here's a code block with Python syntax highlighting:
ru: Вот блок кода с подсветкой синтаксиса Python:

source: Admonitions
ru: Предостережения

source: This is a note admonition. It should appear with a special styling to draw attention.
ru: Это заметка-предостережение. Он должен выглядеть со специальным стилем, чтобы привлечь внимание.

source: This is a warning admonition. It should appear with a distinct styling to indicate caution.
ru: Это предостережение. Он должен выглядеть с четким стилем, чтобы указать на осторожность.

source: Images
ru: Изображений

source: Placeholder image
ru: Изображение-заполнитель

source: Tables
ru: Столы

source: Example Table
ru: Пример таблицы

source: Header 1
ru: Заголовок 1

source: Header 2
ru: Заголовок 2

source: Header 3
ru: Заголовок 3

source: Row 1, Cell 1
ru: Ряд 1, ячейка 1

source: Row 1, Cell 2
ru: Ряд 1, ячейка 2

source: Row 1, Cell 3
ru: Ряд 1, ячейка 3

source: Row 2, Cell 1
ru: Ряд 2, ячейка 1

source: Row 2, Cell 2
ru: Ряд 2, ячейка 2

source: Row 2, Cell 3
ru: Ряд 2, ячейка 3

source: Links
ru: Ссылки

source: This is an example of an `external link <https://www.example.com>`_.
ru: Это пример внешней ссылки <https://www.example.com>`_.

source: This is an example of an :ref:`internal link <test_css_layout>`.
ru: Это пример :ref:`внутренней ссылки <test_css_layout>`.

source: Is your problem white box?
ru: Ваша проблема — это белый ящик?

source: If your problem is not white box it makes little sense to use Bayesian methods. The approach relies on clear understanding and reasoning about the problem.
ru: Если ваша проблема — не белый ящик, нет смысла использовать байесовские методы. Подход основан на четком понимании и рассуждениях о проблеме.

source: How much do you know about the problem?
ru: Как много вы знаете о проблеме?

source: The more you understand about the model and process it describes the better is the solution. No traditional approach takes this to the absolute and translates expert opinions to rigor definition.
ru: Чем больше вы понимаете модель и процесс, который она описывает, тем лучше решение. Никакой традиционный подход не возводит это в абсолют и не переводит мнения экспертов в строгое определение.

source: Do you understand causal relations of your problem?
ru: Вы понимаете причинно-следственные связи вашей проблемы?

source: Understanding relations is a half-way to build a Bayesian model. Ignoring these relations leads to biased estimates and decisions.
ru: Понимание отношений — это половина пути к построению байесовской модели. Игнорирование этих отношений приводит к необъективным оценкам и решениям.
